Revit 2024 API
ExternalServices.BuiltInExternalServices Class
 A collection of ids for external services that are managed and used by Revit directly.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class BuiltInExternalServices
Visual Basic
Public NotInheritable Class BuiltInExternalServices
Visual C++
public ref class BuiltInExternalServices abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices
See Also
ExternalServices.BuiltInExternalServices Members
Autodesk.Revit.DB.ExternalService Namespace